
## :white_check_mark: Apply Succeeded (annotations-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/36732)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Reading...
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
aws_codedeploy_app.sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125: Refreshing state... [id=c439825a-7620-47a3-ab30-d9690059e395:AnnotationsAPI-Prod-Sqs-Event-Consumer-Lambda]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-SNS-Topic-DLQ]
aws_dynamodb_table.dynamodb_highlight-notes_dynamodb_table_8BD520BF: Refreshing state... [id=ANNOT-Prod-highlight-notes]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Refreshing state... [id=pocket-annotationsapi-prod-synthetic-checks]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/AnnotationsAPI-Prod/ecs/app]
data.aws_caller_identity.caller: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/AnnotationsAPI-Prod]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue-Deadletter]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/33ef5b88-93c8-497a-b8ce-128e1ca29a8d]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 1s [id=/Shared/PublicSubnets]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Reading...
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Read complete after 1s [id=pocket-data-items]
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Read complete after 0s [id=1349007126]
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/AnnotationsAPI-Prod/ecs/aws-otel-collector]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_region.region: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AnnotationsAPI-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.terraform_remote_state.incident_management: Read complete after 1s
aws_s3_bucket.sqs-event-consumer_lambda_code-bucket_DA349A4E: Refreshing state... [id=pocket-annotationsapi-prod-sqs-event-consumer]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AnnotationsAPI-Prod-Infrastructure-Alarm-Critical]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z04486481VH68XXRQZ04W]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 1s [id=Z2BHWTOWFVNW3M]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Read complete after 0s [id=4250039221]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Read complete after 0s [id=2591764522]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=annotationsapi-prod-app]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=d098b579-8f4f-4c6e-be37-c9b75ccdb37e:AnnotationsAPI-Prod-ECS]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=AnnotationsAPI-Prod-ECSCodeDeployRole]
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue]
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Refreshing state... [id=pocket-annotationsapi-prod-synthetic-check]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=AnnotationsAPI-Prod-TaskRole]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=AnnotationsAPI-Prod-TaskExecutionRole]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_iam_role.sqs-event-consumer_lambda_execution-role_971EF5C2: Refreshing state... [id=AnnotationsAPI-Prod-Sqs-Event-Consumer-ExecutionRole]
aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PUF5C26]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PNWWAAT]
aws_iam_policy.sqs-event-consumer_lambda_execution-policy_4069CEFE: Refreshing state... [id=arn:aws:iam::996905175585:policy/AnnotationsAPI-Prod-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_iam_role.sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46: Refreshing state... [id=AnnotationsAPI-Prod-Sqs-Event-Consumer-CodeDeployRole]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Refreshing state... [id=pocket-annotationsapi-prod-synthetic-checks]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=368661050]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=74604349]
data.aws_vpc.pocket-vpc_2587E211: Reading...
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z04486481VH68XXRQZ04W__ad3b7ce4e2917aae5b9b45ea3a574eb5.annotations-api.readitlater.com._CNAME]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_annotations-api.readitlater.com_NS]
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Reading...
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Read complete after 0s [id=411515311]
aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:86a25318-85cb-4238-979a-664517a43a00]
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Reading...
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Read complete after 0s [id=1874106768]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/c0759332e7c395f1440c39e69fa42801841d0624]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=annotationsapi-prod-app]
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Reading...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/AnnotationsAPI-Prod-TaskRolePolicy]
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Read complete after 0s [id=3039331729]
aws_s3_bucket_public_access_block.sqs-event-consumer_lambda_code-bucket-public-access-block_BB3EE815: Refreshing state... [id=pocket-annotationsapi-prod-sqs-event-consumer]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=AnnotationsAPI-Prod-TaskExecutionRole-2022020800381344850000000a]
aws_s3_bucket_ownership_controls.sqs-event-consumer_lambda_code-bucket-ownership-controls_E3CCA008: Refreshing state... [id=pocket-annotationsapi-prod-sqs-event-consumer]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=AnnotationsAPI-Prod-ECSCodeDeployRole-20220208003813027500000009]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/AnnotationsAPI-Prod-TaskExecutionRolePolicy]
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Refreshing state... [id=arn:aws:iam::996905175585:policy/pocket-annotationsapi-prod-synthetic-check-access]
aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-SNS-Topic-DLQ]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=P08W3J8]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P3HH4YY]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PJ4F46S]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PFVU3U2]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda_execution-role-policy-attachment_B4842CE7: Refreshing state... [id=AnnotationsAPI-Prod-Sqs-Event-Consumer-ExecutionRole-20220516230643765100000001]
aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/AnnotationsAPI-Prod-Sqs-Event-Consumer-Queue]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ANNOTb20220208003811794100000002/a0f0eb4ea2a923c8]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_vpc.pocket-vpc_2587E211: Read complete after 1s [id=vpc-867638e3]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ANNOTg20220208003812626700000008/6b1dc28598a9ccb4]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-0c29baaa84d59b6f8]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
aws_iam_policy.sqs-event-consumer_sqs-policy_9FE8B4E1: Refreshing state... [id=arn:aws:iam::996905175585:policy/AnnotationsAPI-Prod-Sqs-Event-Consumer-LambdaSQSPolicy]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_5F4F021D: Refreshing state... [id=AnnotationsAPI-Prod-Sqs-Event-Consumer-CodeDeployRole-20220516230643791400000002]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=2022-02-08 00:39:32.121 +0000 UTC]
aws_codedeploy_deployment_group.sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807: Refreshing state... [id=5a99c84d-5812-4317-84c9-a3b68c617356]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=AnnotationsAPI-Prod-TaskRole-2022020800381358080000000c]
aws_s3_bucket_acl.sqs-event-consumer_lambda_code-bucket-acl_8FA13E85: Refreshing state... [id=pocket-annotationsapi-prod-sqs-event-consumer,private]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=AnnotationsAPI-Prod-TaskExecutionRole-2022020800381353560000000b]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Refreshing state... [id=pocket-annotationsapi-prod-synthetic-check-20230727040525402800000001]
data.aws_vpc.redis_vpc_45DE3471: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AnnotationsAPI-Prod-Infrastructure-Alarm-Non-Critical:c7431e2e-fcad-4254-b70d-b18971c6e4ad]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:AnnotationsAPI-Prod-Infrastructure-Alarm-Critical:a9c9fb45-aac8-4598-aa35-011fbbcf8ffd]
aws_iam_role_policy_attachment.sqs-event-consumer_execution-role-policy-attachment_2A5E0086: Refreshing state... [id=AnnotationsAPI-Prod-Sqs-Event-Consumer-ExecutionRole-20220516230733800700000003]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-043047953d5242bbf]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29]
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Refreshing state... [id=annotationsapi-prod-elasticachesubnetgroup]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Refreshing state... [id=annot-prod-uptime-0]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B: Refreshing state... [id=annot-prod-query-0]
aws_lambda_function.sqs-event-consumer_lambda_477DAF53: Refreshing state... [id=AnnotationsAPI-Prod-Sqs-Event-Consumer-Function]
data.aws_vpc.redis_vpc_45DE3471: Read complete after 0s [id=vpc-867638e3]
aws_security_group.redis_elasticache_security_group_24BFB83E: Refreshing state... [id=sg-069d0b4a10e773a7b]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Refreshing state... [id=annot-prod-uptime-0]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_query_0_52F9FF21: Refreshing state... [id=annot-prod-query-0]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29/59ca60027b6ddb92]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29/3b7fa77651eb6896]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z04486481VH68XXRQZ04W_annotations-api.readitlater.com_A_1]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=AnnotationsAPI-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_lambda_alias.sqs-event-consumer_lambda_alias_8B8F9784: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:AnnotationsAPI-Prod-Sqs-Event-Consumer-Function:DEPLOYED]
aws_cloudwatch_log_group.sqs-event-consumer_lambda_log-group_A465ADCF: Refreshing state... [id=/aws/lambda/AnnotationsAPI-Prod-Sqs-Event-Consumer-Function]
aws_elasticache_replication_group.redis_elasticache_replication_group_6DE00446: Refreshing state... [id=annotationsapi-prod]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/ANNOT2022020800381408710000000d/9ca9ac81b32d5d29/59ca60027b6ddb92/71608ce5f0a93a1d]
aws_lambda_event_source_mapping.sqs-event-consumer_lambda_event_source_mapping_5E8B497D: Refreshing state... [id=71c50695-4051-444d-874b-3e86ecde9061]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=AnnotationsAPI-Prod]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=ee8acaf0a9a837fef4c07252759d8f02d2b5ee4d]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/AnnotationsAPI-Prod/AnnotationsAPI-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=AnnotationsAPI-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=8f40e742-41e8-4685-9f15-10491fe71ca2]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/AnnotationsAPI-Prod/AnnotationsAPI-Prod]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=AnnotationsAPI-Prod-ScaleOutPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=AnnotationsAPI-Prod-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=AnnotationsAPI-Prod Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=AnnotationsAPI-Prod Service Low CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes",
              + "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes/*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue",
            ]
        }
    }

  # aws_dynamodb_table.dynamodb_highlight-notes_dynamodb_table_8BD520BF will be updated in-place
  ~ resource "aws_dynamodb_table" "dynamodb_highlight-notes_dynamodb_table_8BD520BF" {
        id                          = "ANNOT-Prod-highlight-notes"
        name                        = "ANNOT-Prod-highlight-notes"
        tags                        = {
            "environment" = "Prod"
            "service"     = "AnnotationsAPI"
        }
        # (9 unchanged attributes hidden)

      - global_secondary_index {
          - hash_key           = "userId" -> null
          - name               = "userId" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "KEYS_ONLY" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      + global_secondary_index {
          + hash_key           = "userId"
          + name               = "userId"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + read_capacity      = 5
          + write_capacity     = 5
        }

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/AnnotationsAPI-Prod:644" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/AnnotationsAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/annotationsapi-prod-app:7b8c12af396a707b525431a9415deeb1f611adc2" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/annotationsapi-prod-app:9bc508a3dee0f7197f12823b57224b6ae1fc422c"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "AnnotationsAPI-Prod" -> (known after apply)
      ~ revision                 = 644 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "AnnotationsAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id        = "arn:aws:iam::996905175585:policy/AnnotationsAPI-Prod-TaskRolePolicy"
        name      = "AnnotationsAPI-Prod-TaskRolePolicy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:Get*",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:Delete*",
                          - "dynamodb:BatchWrite*",
                          - "dynamodb:BatchGet*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes/*",
                          - "arn:aws:dynamodb:us-east-1:996905175585:table/ANNOT-Prod-highlight-notes",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "sqs:SendMessageBatch",
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sqs:us-east-1:996905175585:AnnotationsAPI-Prod-Batch-Delete-Consumer-Queue"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "environment" = "Prod"
            "service"     = "AnnotationsAPI"
        }
        # (4 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=AnnotationsAPI-Prod]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_dynamodb_table.dynamodb_highlight-notes_dynamodb_table_8BD520BF: Modifying... [id=ANNOT-Prod-highlight-notes]
aws_dynamodb_table.dynamodb_highlight-notes_dynamodb_table_8BD520BF: Modifications complete after 0s [id=ANNOT-Prod-highlight-notes]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1845415243]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=AnnotationsAPI-Prod]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=7acb91e2250ef3baff16e9a3282bb93498ea9869]

Apply complete! Resources: 2 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"6d969e09-2c13-4726-8fa3-99508ebd9750","JobName":"annotations-api_infrastructure_apply_prod","PRNumber":142,"Program":"tfcmt","SHA1":"9bc508a3dee0f7197f12823b57224b6ae1fc422c","Target":"annotations-api-cdk","Vars":{}} -->